#+OPTIONS: toc:nil
# #+LaTeX_CLASS: koma-article 

#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation,aspectratio=169]
#+OPTIONS: H:2

#+LaTex_HEADER: \usepackage{khpreamble}
#+LaTex_HEADER: \usepackage{amssymb}
#+LaTex_HEADER: \usepgfplotslibrary{groupplots}
#+LaTex_HEADER: \usepackage{gensymb}

#+LaTex_HEADER: \newcommand*{\shift}{\operatorname{q}}

#+title: Sensores, Encoder incremental
#+author: Kjartan Halvorsen
#+date: 2021-02-15

*** Calculations                                                   :noexport:

#+BEGIN_SRC python :session :results output 
  import numpy as np
  CPR = 32.0
  dc = 5
  dt = 5e-3
  v = dc/dt/CPR*2*np.pi
  print("Vel = %0.1f rad/s" %v)

#+END_SRC

#+RESULTS:
: Vel = 196.3 rad/s


   
   


*** Calculations                                                   :noexport:

#+BEGIN_SRC python :session :results output 
  import numpy as np
  CPR = 32.0
  dc = 5
  dt = 5e-3
  v = dc/dt/CPR*2*np.pi
  print("Vel = %0.1f rad/s" %v)

#+END_SRC

#+RESULTS:
: Vel = 196.3 rad/s


   
   


*** Calculations                                                   :noexport:

#+BEGIN_SRC python :session :results output 
  import numpy as np
  CPR = 32.0
  dc = 1
  dt = 0.65e-3
  v = dc/dt/CPR*2*np.pi
  print("Vel = %0.1f rad/s" %v)

#+END_SRC

#+RESULTS:
: Vel = 302.1 rad/s


   
   


